[Reference](https://medium.com/nerd-for-tech/top-3-pandas-tricks-i-wish-i-knew-before-604cbe4166ea)

In [2]:
import pandas as pd

In [3]:
names = ['Hemant', 'John', 'ABC', 'XYZ', 'Hemant', 'John', 'Hemant', 'Hemant', 'John', 'ABC']
cost = [9, 10, 1, 5, 2, 6, 4, 1, 12, 7]
df = pd.DataFrame({'Name': names, 'Order_Cost': cost})

In [4]:
perc_order_cost = df.groupby('Name')['Order_Cost'].apply(lambda x : x/x.sum()*100)
df['perc_order_cost'] = perc_order_cost

In [5]:
df

     Name  Order_Cost  perc_order_cost
0  Hemant           9        56.250000
1    John          10        35.714286
2     ABC           1        12.500000
3     XYZ           5       100.000000
4  Hemant           2        12.500000
5    John           6        21.428571
6  Hemant           4        25.000000
7  Hemant           1         6.250000
8    John          12        42.857143
9     ABC           7        87.500000

In [8]:
station_id = [8809, 8810, 8811, 8812, 8813]
pollutants = [{'a': '46', 'b': '3', 'c': '12'},
              {'a': '36', 'b': '5', 'c': '8'},
              {'b': '2', 'c': '7'},
              {'c': '11'},
              {'a': '82', 'c': '15'}]

In [12]:
df = pd.DataFrame({'Station_ID': station_id, 'Pollutants': pollutants})

In [13]:
df

   Station_ID                        Pollutants
0        8809  {'a': '46', 'b': '3', 'c': '12'}
1        8810   {'a': '36', 'b': '5', 'c': '8'}
2        8811              {'b': '2', 'c': '7'}
3        8812                       {'c': '11'}
4        8813            {'a': '82', 'c': '15'}

In [14]:
pd.json_normalize(df['Pollutants'])

     a    b   c
0   46    3  12
1   36    5   8
2  NaN    2   7
3  NaN  NaN  11
4   82  NaN  15

In [15]:
pd.concat([df, pd.json_normalize(df['Pollutants'])], axis = 1)

   Station_ID                        Pollutants    a    b   c
0        8809  {'a': '46', 'b': '3', 'c': '12'}   46    3  12
1        8810   {'a': '36', 'b': '5', 'c': '8'}   36    5   8
2        8811              {'b': '2', 'c': '7'}  NaN    2   7
3        8812                       {'c': '11'}  NaN  NaN  11
4        8813            {'a': '82', 'c': '15'}   82  NaN  15

In [16]:
df['Pollutants'].apply(pd.Series)

     a    b   c
0   46    3  12
1   36    5   8
2  NaN    2   7
3  NaN  NaN  11
4   82  NaN  15

In [17]:
df[['a', 'b', 'c']] = df['Pollutants'].apply(pd.Series)

In [18]:
df

   Station_ID                        Pollutants    a    b   c
0        8809  {'a': '46', 'b': '3', 'c': '12'}   46    3  12
1        8810   {'a': '36', 'b': '5', 'c': '8'}   36    5   8
2        8811              {'b': '2', 'c': '7'}  NaN    2   7
3        8812                       {'c': '11'}  NaN  NaN  11
4        8813            {'a': '82', 'c': '15'}   82  NaN  15

In [20]:
import numpy as np

In [21]:
dates = pd.date_range(start = '2021-05-01', end = '2021-05-31')
values = np.random.randint(100, size = 31)
df = pd.DataFrame({'date': dates, 'Value': values})
df.set_index('date', inplace=True)

In [22]:
df

            Value
date
2021-05-01     63
2021-05-02     25
2021-05-03     29
2021-05-04     98
2021-05-05     43
2021-05-06     98
2021-05-07     82
2021-05-08     43
2021-05-09     62
2021-05-10     96
2021-05-11     42
2021-05-12     61
2021-05-13     16
2021-05-14     61
2021-05-15     70
2021-05-16      7
2021-05-17     95
2021-05-18     54
2021-05-19     96
2021-05-20     46
2021-05-21     36
2021-05-22     63
2021-05-23     14
2021-05-24     50
2021-05-25     22
2021-05-26     88
2021-05-27     27
2021-05-28     46
2021-05-29     77
2021-05-30     90
2021-05-31      1

In [23]:
hourly = df.resample('H').ffill()

In [24]:
weekly = df.resample('W').mean()